# 3.	Вам дан английский текст. Закодируйте его с помощью азбуки Морзе:
#
# Входные данные	Выходные данные
# Help me SOS
# 	            .... . .-.. .--.
#                 -- .
#                 ... --- ...


MORSE = {'A': '.-', 'B': '-...', 'C': '-.-.',
         'D': '-..', 'E': '.', 'F': '..-.',
         'G': '--.', 'H': '....', 'I': '..',
         'J': '.---', 'K': '-.-', 'L': '.-..',
         'M': '--', 'N': '-.', 'O': '---',
         'P': '.--.', 'Q': '--.-', 'R': '.-.',
         'S': '...', 'T': '-', 'U': '..-',
         'V': '...-', 'W': '.--', 'X': '-..-',
         'Y': '-.--', 'Z': '--..'}

string = "Help me SOS"

for st in string.split(' '):
    for s in st:
        print(MORSE[s.title()], end=' ')
    print()
